УТ_для_edt/src/DataProcessors/CRM_РегистрацияОбъектовВУниверсальномЖурналеДокументов/CRM_РегистрацияОбъектовВУниверсальномЖурналеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_РегистрацияОбъектовВУниверсальномЖурналеДокументов</name>
</mdclass:DataProcessor>

УТ_для_edt/src/InformationRegisters/CRM_ЖурналДокументов/CRM_ЖурналДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЖурналДокументов</name>
  <resources>
    <name>ТипОбъекта</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CRM_ОбъектыЖурналаДокументов</types>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </resources>
  <resources>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </resources>
  <resources>
    <name>ВходящееИсходящее</name>
    <type>
      <types>EnumRef.CRM_ВходящееИсходящееСобытие</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.CRM_ВидыСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеСобытия</name>
    <type>
      <types>CatalogRef.CRM_СостоянияСобытий</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеИнтереса</name>
    <comment>Состояние интереса</comment>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьПрисоединенныеФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойИнтерес</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтересЯвляетсяОснованием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СписокУчастников</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ГлавнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>Characteristic.CRM_ОбъектыЖурналаДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CRM_Интерес</name>
    <comment>Интерес</comment>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/DataProcessors/CRM_РегистрацияОбъектовВУниверсальномЖурналеДокументов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗарегистрироватьРазрегистрироватьОбъекты(МассивОбъектов, Зарегистрировать, ПериодНачало = Неопределено, ПериодОкончание = Неопределено) Экспорт
	Если МассивОбъектов.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	Если Зарегистрировать Тогда
		ТекстЗапроса = "";
		
		Для нИндекс = 0 По МассивОбъектов.ВГраница() Цикл
			Объект = МассивОбъектов[нИндекс];
			
			ПолноеИмя = CRM_КлиентыСервер.ПолучитьПолноеИмяМетаданныхОбъектаПоСсылкеНаПВХОбъектыЖурнала(Объект);
			Если Не ЗначениеЗаполнено(ПолноеИмя) Тогда Продолжить; КонецЕсли;
			
			ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ Ссылка КАК Ссылка
			|
			|ИЗ " + ПолноеИмя + "
			|";
			
			Если ЗначениеЗаполнено(ПериодНачало) Или ЗначениеЗаполнено(ПериодОкончание) Тогда
				бЕстьДата = Ложь;
				МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
				Попытка
					ТестоваяПеременная = МетаданныеОбъекта.СтандартныеРеквизиты.Дата;
					бЕстьДата = Истина;
				Исключение КонецПопытки;
				Если Не бЕстьДата Тогда
					Попытка
						ТестоваяПеременная = МетаданныеОбъекта.Реквизиты.Дата;
						бЕстьДата = Истина;
					Исключение КонецПопытки;
				КонецЕсли;
				
				Если бЕстьДата Тогда
					Если ЗначениеЗаполнено(ПериодНачало) И ЗначениеЗаполнено(ПериодОкончание) Тогда
						ТекстЗапроса = ТекстЗапроса + "
						| ГДЕ Дата МЕЖДУ &ПериодНачало И &ПериодОкончание"
					ИначеЕсли ЗначениеЗаполнено(ПериодНачало) Тогда
						ТекстЗапроса = ТекстЗапроса + "
						| ГДЕ Дата >= &ПериодНачало"
					ИначеЕсли ЗначениеЗаполнено(ПериодОкончание) Тогда
						ТекстЗапроса = ТекстЗапроса + "
						| ГДЕ Дата <= &ПериодОкончание"
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если нИндекс <> МассивОбъектов.ВГраница() Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|"
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		ТекстЗапроса = "ВЫБРАТЬ Объект КАК Ссылка ИЗ РегистрСведений.CRM_ЖурналДокументов ГДЕ ТипОбъекта В (&МассивОбъектов)";
		
		Если ЗначениеЗаполнено(ПериодНачало) И ЗначениеЗаполнено(ПериодОкончание) Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|И Дата МЕЖДУ &ПериодНачало И &ПериодОкончание"
		ИначеЕсли ЗначениеЗаполнено(ПериодНачало) Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|И Дата >= &ПериодНачало"
		ИначеЕсли ЗначениеЗаполнено(ПериодОкончание) Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|И Дата <= &ПериодОкончание"
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	ПараметрыЗапроса = Запрос.НайтиПараметры();
	Если ПараметрыЗапроса.Найти("ПериодНачало") <> Неопределено Тогда
		Запрос.УстановитьПараметр("ПериодНачало", ПериодНачало);
	КонецЕсли;
	Если ПараметрыЗапроса.Найти("ПериодОкончание") <> Неопределено Тогда
		Запрос.УстановитьПараметр("ПериодОкончание", ПериодОкончание);
	КонецЕсли;
	Если ПараметрыЗапроса.Найти("МассивОбъектов") <> Неопределено Тогда
		Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Зарегистрировать Тогда
			CRM_КлиентыСервер.ЗарегистрироватьОбъектВОбщемЖурнале(Выборка.Ссылка.ПолучитьОбъект(), Ложь);
		Иначе
			НаборЗаписей = РегистрыСведений.CRM_ЖурналДокументов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Выборка.Ссылка);
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗарегистрироватьОбъектыФоновоеЗадание(Параметры) Экспорт 
	Попытка
		СтруктураНастроек = Новый Структура();  
		СтруктураНастроек.Вставить("МассивОбъектов", CRM_КлиентыСервер.ПолучитьВсеЭлементыПВХОбъектыЖурнала());
		СтруктураНастроек.Вставить("Зарегистрировать", Истина);
		СтруктураНастроек.Вставить("ПериодНачало", Дата(1,1,1));
		СтруктураНастроек.Вставить("ПериодОкончание", КонецДня(ТекущаяДатаСеанса()));
		ЗарегистрироватьРазрегистрироватьОбъекты(СтруктураНастроек.МассивОбъектов, СтруктураНастроек.Зарегистрировать, СтруктураНастроек.ПериодНачало, СтруктураНастроек.ПериодОкончание); 
		Параметры.ОбработкаЗавершена = Истина; 
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,
			РегистрыСведений.CRM_ЖурналДокументов,,
			НСтр("ru='Заполнение журнала документов завершено'"));
	Исключение
		ВызватьИсключение НСтр("ru='Заполнение журнала документов не удалось'");
		
	КонецПопытки;
КонецПроцедуры	
#КонецОбласти

#КонецЕсли
